//******************************************************************************
//
// MIDITrail / DXH
//
// ヘルパ関数クラス
//
// Copyright (C) 2019 WADA Masashi. All Rights Reserved.
//
//******************************************************************************

#pragma once

#include <d3d9.h>
#include <d3dx9.h>


//******************************************************************************
// ヘルパ関数クラス
//******************************************************************************
class DXH
{
public:

	//座標回転：YZ平面
	static D3DXVECTOR3 RotateYZ(
			float centerY,
			float centerZ,
			D3DXVECTOR3 p1,
			float angle
		);

};


