//******************************************************************************
//
// MIDITrail / MTGridBoxMod
//
// グリッドボックス描画Modクラス
//
// Copyright (C) 2012 Yossiepon Oniichan. All Rights Reserved.
//
//******************************************************************************

#include "StdAfx.h"
#include "MTGridBoxMod.h"


//******************************************************************************
// コンストラクタ
//******************************************************************************
MTGridBoxMod::MTGridBoxMod(void)
{
	m_isEnable = true;
}

//******************************************************************************
// デストラクタ
//******************************************************************************
MTGridBoxMod::~MTGridBoxMod(void)
{
}

//******************************************************************************
// 描画
//******************************************************************************
int MTGridBoxMod::Draw(
		LPDIRECT3DDEVICE9 pD3DDevice
	)
{
	int result = 0;

	if (!m_isEnable) goto EXIT;

	result = MTGridBox::Draw(pD3DDevice);
	if (result != 0) goto EXIT;

EXIT:;
	return result;
}

//******************************************************************************
// 表示設定
//******************************************************************************
void MTGridBoxMod::SetEnable(
		bool isEnable
	)
{
	m_isEnable = isEnable;
}
